---
kind: method
id: M:Autodesk.Revit.DB.SpacingRule.SetLayoutNone
source: html/c0298fa3-d629-0e9f-ba28-421e6b4f0c4d.htm
---
# Autodesk.Revit.DB.SpacingRule.SetLayoutNone Method

Set the Layout property to None.

## Syntax (C#)
```csharp
public void SetLayoutNone()
```

## Remarks
No internal lines will be
generated, but the effect is equivalent to having two
lines, one at each end of the region.